
const posts = [
    {
        userId: 1,
        id: 1,
        title: "آیا می‌توان کارهای بزرگ انجام داد بدون اینکه به دیگران دوغ برسانیم؟",
        body: "زیرا باید مسئولیت‌ها را پذیرفت\nپذیرش پیامدها و تلاش برای پیشرفت\nدرک مشکلات و تلاش برای حل آن‌ها\nزندگی ما مجموعه‌ای از تجربیات و یادگیری‌هاست"
    },
    {
        userId: 2,
        id: 2,
        title: "آیا می‌توان کارهای بزرگ انجام داد بدون اینکه به دیگران دوغ برسانیم؟",
        body: "زیرا باید مسئولیت‌ها را پذیرفت\nپذیرش پیامدها و تلاش برای پیشرفت\nدرک مشکلات و تلاش برای حل آن‌ها\nزندگی ما مجموعه‌ای از تجربیات و یادگیری‌هاست"
    },
    {
        userId: 3,
        id: 3,
        title: "آیا می‌توان کارهای بزرگ انجام داد بدون اینکه به دیگران دوغ برسانیم؟",
        body: "زیرا باید مسئولیت‌ها را پذیرفت\nپذیرش پیامدها و تلاش برای پیشرفت\nدرک مشکلات و تلاش برای حل آن‌ها\nزندگی ما مجموعه‌ای از تجربیات و یادگیری‌هاست"
    }
]



export const get_allPosts_service = () => posts
export const get_postById_service = (id: number) => posts.find(val => val.id === id)